SO/Scenario 1.8/SO_07_Create_SO.yaml
config:
  payload:
    path: "data.csv"
    fields:
      - "uuid"
    order: "sequence"
  target: "https://moonlay-api.dbo.dev"
  processor: "generateFaker.js"
  phases:
- duration: 1
      arrivalRate: 220
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20

    - duration: 1
      arrivalRate: 220
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20


    - duration: 1
      arrivalRate: 220
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20

    - duration: 1
      arrivalRate: 220
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20


    - duration: 1
      arrivalRate: 220
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20


    - duration: 1
      arrivalRate: 220
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20


    - duration: 1
      arrivalRate: 220
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20

    - duration: 1
      arrivalRate: 220
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20

    - duration: 1
      arrivalRate: 220
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20

    - duration: 1
      arrivalRate: 220
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20

    - duration: 1
      arrivalRate: 220
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20

    - duration: 1
      arrivalRate: 220
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20

    - duration: 1
      arrivalRate: 220
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20

    - duration: 1
      arrivalRate: 220
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20

    - duration: 1
      arrivalRate: 220
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20

    - duration: 1
      arrivalRate: 220
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20

    - duration: 1
      arrivalRate: 220
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20

    - duration: 1
      arrivalRate: 220
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20

    - duration: 1
      arrivalRate: 220
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20

    - duration: 1
      arrivalRate: 220
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20

    - duration: 1
      arrivalRate: 220
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20

    - duration: 1
      arrivalRate: 220
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20

    - duration: 1
      arrivalRate: 220
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20

    - duration: 1
      arrivalRate: 220
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20

    - duration: 1
      arrivalRate: 220
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20

    - duration: 1
      arrivalRate: 220
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20

    - duration: 1
      arrivalRate: 220
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20

    - duration: 1
      arrivalRate: 220
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
      
    - duration: 1
      arrivalRate: 220
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20

    - duration: 1
      arrivalRate: 220
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20

    - duration: 1
      arrivalRate: 220
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20

    - duration: 1
      arrivalRate: 220
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20

    - duration: 1
      arrivalRate: 220
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20

    - duration: 1
      arrivalRate: 220
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20

    - duration: 1
      arrivalRate: 220
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20

    - duration: 1
      arrivalRate: 220
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20

    - duration: 1
      arrivalRate: 220
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20

    - duration: 1
      arrivalRate: 220
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20

    - duration: 1
      arrivalRate: 220
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20

    - duration: 1
      arrivalRate: 220
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20

    - duration: 1
      arrivalRate: 220
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20

    - duration: 1
      arrivalRate: 220
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20

    - duration: 1
      arrivalRate: 220
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20

    - duration: 1
      arrivalRate: 220
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20

    - duration: 1
      arrivalRate: 220
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20

    - duration: 1
      arrivalRate: 220
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20

    - duration: 1
      arrivalRate: 220
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20

    - duration: 1
      arrivalRate: 220
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20

    - duration: 1
      arrivalRate: 220
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20

    - duration: 1
      arrivalRate: 220
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20

    - duration: 1
      arrivalRate: 220
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20

    - duration: 1
      arrivalRate: 220
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
      
    - duration: 1
      arrivalRate: 220
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20

    - duration: 1
      arrivalRate: 220
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20

    - duration: 1
      arrivalRate: 220
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20

    - duration: 1
      arrivalRate: 220
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20

    - duration: 1
      arrivalRate: 220
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20

    - duration: 1
      arrivalRate: 220
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20

    - duration: 1
      arrivalRate: 220
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20

    - duration: 1
      arrivalRate: 220
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20

    - duration: 1
      arrivalRate: 220
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20

    - duration: 1
      arrivalRate: 220
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20

    - duration: 1
      arrivalRate: 220
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20

    - duration: 1
      arrivalRate: 220
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20

    - duration: 1
      arrivalRate: 220
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20

    - duration: 1
      arrivalRate: 220
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20

    - duration: 1
      arrivalRate: 220
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20

    - duration: 1
      arrivalRate: 220
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20

    - duration: 1
      arrivalRate: 220
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20

    - duration: 1
      arrivalRate: 220
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20
    - duration: 1
      arrivalRate: 20

scenarios:
  - flow:
      - function: "createRandomUser"
      - post:
          url: "/order-srv/sales-orders"
          headers:
            X-CHANNEL: "web_manager"
            Authorization: "Basic ZGJvLW9yZGVyLXNydjpkYm8tb3JkZXItc3J2LXBhc3N3ZA=="
          json:
            cart_id: 12
            agent_id: 4
            store_id: 1419
            user_id: 147
            visitation_id: 1
            salesman_id: 520
            order_source_id: 1
            so_date: "2023-09-21"
            so_ref_code: "{{ uuid }}"
            so_ref_date: "2023-09-21"
            total_amount: 10000000
            total_tonase: 1000
            g_long: -5.12341  
            g_lat: -10.9921
            note: "tes notes"
            internal_comment: "tes internal comment"
            device_id: "id"
            referral_code: "NDA-124246"
            sales_order_details:  
               - brand_id: 2
                 product_id: 985
                 uom_id: 1
                 qty: 2
                 price: 150000
                 note: "tes notes order detail 1"
               - brand_id: 1
                 product_id: 991
                 uom_id: 1
                 qty: 15
                 price: 150000
                 note: "tes notes order detail 1"